import './App.css'
import { Tabs, TabsContent, TabsList, TabsTrigger } from "@/components/ui/tabs"
function App() {
  return (
    <>
      <h1 className="text-2xl md:text-3xl font-bold text-center mb-4">
        <span className="md:hidden">
          कमला देवी ह्यारिस<br />
          राष्ट्रपतिको लागि
        </span>
        <span className="hidden md:inline">
          कमला देवी ह्यारिस राष्ट्रपतिको लागि
        </span>
      </h1>
      <Tabs defaultValue="kamala" className="w-[350px] sm:w-[500px] md:w-[700px]">
        <TabsList className="grid w-full grid-cols-2">
          <TabsTrigger value="kamala" className="text-lg font-semibold data-[state=active]:bg-blue-200 data-[state=active]:shadow-md">नीति
          </TabsTrigger>
          <TabsTrigger value="voting" className="text-lg font-semibold data-[state=active]:bg-blue-200 data-[state=active]:shadow-md">मतदान जानकारी</TabsTrigger>
        </TabsList>
        <TabsContent value="kamala" className='flex flex-col gap-2 p-4'>
          <h2 className="text-center">कमला ह्यारिसको नीति जानकारी</h2>
          <h3 className="text-xl font-semibold mb-2">कमलाको नीतिले नेपाली समुदायलाई किन फाइदा पुग्छ भन्ने बारे जान्नुहोस्।</h3>

          <div className="mt-4">
            <h4 className="text-lg font-semibold mb-2">अर्थतन्त्र</h4>
            <h5 className="font-semibold mb-1">कमलाको नीति</h5>
            <ul className="list-disc pl-5 mb-4">
              <li>वार्षिक $ 400,000 कमाउने व्यक्तिहरूले उस्तै वा कम कर तिर्नेछन् (स्रोत)</li>
              <li>नवजात बच्चाहरू भएका परिवारहरूले पुनर्स्थापित बाल कर क्रेडिट मार्फत $ 6,000 कर कटौती प्राप्त गर्नेछन् (स्रोत)</li>
              <li>Earned Income Tax Credit स्थायी बनाएर (स्रोत) बच्चा नभएका व्यक्तिहरूले $ 1500 सम्म पाउनेछन् (स्रोत)</li>
              <li>यो धनी ($ 400K एकल वा $ 450K संयुक्त भन्दा माथिको आय), $ 1M भन्दा बढीको अवास्तविक पूंजीगत लाभ, र निगमहरूमा बढेको करहरू (स्रोत)</li>
            </ul>

            <h5 className="font-semibold mb-1">ट्रम्पको नीतिहरू</h5>
            <p>उनको सबैभन्दा ठूलो आर्थिक प्रस्ताव ट्यारिफ हो - समग्रमा 10-20%, र 60% चीनको लागि। उनको दाबी अनुसार, ट्यारिफहरू "अन्य देशहरूलाई लाग्ने कर" हुन्। तर रिपब्लिकन अर्थशास्त्रीहरूले पनि आशा गर्छन् कि यसले औसत अनुमानित लागत खर्च गर्नेछ। $3,650 देखि $4,300 (स्रोत)</p>
          </div>

          <div className="mt-4">
            <h4 className="text-lg font-semibold mb-2">अध्यागमन</h4>
            <h5 className="font-semibold mb-1">कमलाको नीति</h5>
            <p>कमलाको अध्यागमनमा मूलधारको नीति छ । उनले दक्षिणी सिमानामा समस्या भएको स्वीकार गर्छिन् र रिपब्लिकनहरूले त्यो सीमाबाट अवैध आप्रवासन रोक्नको लागि लेखेको विधेयकमा हस्ताक्षर गर्ने वाचा गरिन्। (स्रोत)</p>

            <h5 className="font-semibold mt-2 mb-1">ट्रम्प र भ्यान्सको नीति</h5>
            <ul className="list-disc pl-5 mb-4">
              <li>ट्रम्पले अमेरिकामा आप्रवासीहरूलाई सामूहिक निर्वासन गर्न आह्वान गरे (स्रोत)</li>
              <li>ट्रम्पले अमेरिकामा परिवार प्रायोजित भिसा रोक्न प्रयास गरे (स्रोत)</li>
              <li>ट्रम्प र भ्यान्सले अमेरिकी नागरिक बनेकाहरूका लागि प्राकृतिकीकरणलाई उल्टाउने प्रयास गर्न सक्छन्</li>
              <li>२०२० मा, ट्रम्पले न्याय विभागको "डिनैचुरलाइजेशन सेक्शन" स्थापना गरे जसको उद्देश्य प्राकृतिककरण प्रक्रिया मार्फत अमेरिकी नागरिक बनेका आप्रवासीहरूको नागरिकता रद्द गर्नुहोस्। 2019 मा, ICE ले 700,000 अमेरिकी नागरिकहरूको फाइलहरू समीक्षा गर्न बजेट अनुरोध गर्‍यो (स्रोत)</li>
            </ul>
            <p>TPS गैरकानूनी छैन, तर जेडी भान्सले भनेको छ। उनीहरू भनिरहेका छन् कि पहिले कानुनी अध्यागमनलाई भविष्यमा अवैध मान्न सकिन्छ। तिनीहरूको सम्पूर्ण प्लेटफर्म अध्यागमन विरोधी भावनामा आधारित छ। आज TPS छ। अर्को वर्ष के हुनेछ?</p>
          </div>

          <div className="mt-4">
            <h4 className="text-lg font-semibold mb-2">घरको स्वामित्व</h4>
            <ul className="list-disc pl-5 mb-4">
              <li>पहिलो पटक घर खरीद गर्नेहरूले डाउन पेमेन्टमा मद्दत गर्न $ 25,000 प्राप्त गर्नेछन् (स्रोत)</li>
              <li>आपूर्ति अभावका कारण घरहरू साँच्चै महँगो छन्। कमलाले नियमहरू सरल बनाएर र निर्माणकर्ताहरूलाई प्रोत्साहन गरेर 3M नयाँ किफायती घरहरू निर्माण गर्न मद्दत गर्ने योजना बनाएकी छिन्। (स्रोत)</li>
            </ul>
          </div>

          <div className="mt-4">
            <h4 className="text-lg font-semibold mb-2">साना व्यापार समर्थन</h4>
            <p>कमलाको योजना छ नयाँ व्यवसायहरूका लागि स्टार्टअप खर्च कर कटौती $ 5,000 बाट $ 50,000 मा विस्तार गर्नुहोस्, उनको "अवसर अर्थव्यवस्था" एजेन्डा (स्रोत)</p>
          </div>

          <div className="mt-4">
            <h4 className="text-lg font-semibold mb-2">तलबी पारिवारिक बिदा र न्यूनतम ज्याला</h4>
            <p>कमलाले मजदुर वर्गका लागि लड्नेछिन् । उनले न्यूनतम पारिश्रमिकलाई $१५ मा बढाउने, भुक्तान गरिएको परिवार र चिकित्सा बिदा स्थापना गर्ने, र सेवा र आतिथ्य कामदारहरूको लागि सुझावहरूमा कर हटाउने योजना बनाएकी छिन्। (स्रोत)</p>
          </div>

          <div className="mt-4">
            <h4 className="text-lg font-semibold mb-2">जलवायु र विद्युतीकरण</h4>
            <h5 className="font-semibold mb-1">कमलाको नीति</h5>
            <p>IRA (मुद्रास्फीति न्यूनीकरण ऐन), जसको लागि कमलाले टाईब्रेक भोट हालिन्, घरधनीहरूलाई छुट दिनेछ, (स्रोत) सहित:</p>
            <ul className="list-disc pl-5 mb-4">
              <li>नयाँ विद्युतीय खाना पकाउने उपकरणको लागि $840 (जस्तै इन्डक्शन दायरा)</li>
              <li>$ 500 प्राकृतिक ग्याँस वा प्रोपेन एक्लेक्टिक को लागी लागत कभर गर्न मद्दत गर्न</li>
              <li>तपाईंको घरको बिजुली प्यानल अपग्रेड गर्नको लागि $ 4,000 कर क्रेडिट।</li>
            </ul>
            <p>कमलाले जलवायु परिवर्तन वास्तविक भएको भन्दै सरकारले यसबारे केही गर्नुपर्छ भन्ने विश्वास राख्छिन् ।</p>

            <h5 className="font-semibold mt-2 mb-1">ट्रम्पको नीति</h5>
            <ul className="list-disc pl-5 mb-4">
              <li>ट्रम्प लैजान सक्छ $7,500 इलेक्ट्रिक वाहन कर क्रेडिट (स्रोत)</li>
              <li>ट्रम्प चाहन्छन् ब्लक यो कोष (स्रोत)</li>
              <li>ट्रम्पले जलवायु परिवर्तनको वास्ता गर्दैनन्, बढ्दो क्षति तातो लहर र आँधीले हरेक वर्ष निम्त्याइरहेको छ किनभने उनी भन्छन् कि यसले थप सिर्जना गर्न गइरहेको छ। समुद्र किनारको सम्पत्ति (स्रोत)</li>
            </ul>
          </div>

          <div className="mt-4">
            <h4 className="text-lg font-semibold mb-2">स्वास्थ्य सेवा</h4>
            <h5 className="font-semibold mb-1">कमलाको नीति</h5>
            <ul className="list-disc pl-5 mb-4">
              <li>कमलाले बिडेन-ह्यारिस हेल्थकेयर ट्याक्स क्रेडिट वृद्धिलाई स्थायी बनाउनेछ। यसले पहिले नै लाखौं अमेरिकीहरूको लागि औसत $ 800 प्रति वर्ष बचत गर्दैछ। (स्रोत)</li>
              <li>कमला र बाइडेनले मेडिकेयर औषधिको मूल्यमा वार्ता गरेका छन्, र इन्सुलिनको मूल्य ज्येष्ठ नागरिकका लागि $35 मा सीमित गरेका छन्। कमलाले यो क्याप सबै अमेरिकीहरूमा लागू गर्ने योजना बनाइरहेको छ, र सबै अमेरिकीहरूका लागि जेब बाहिर खर्चमा $2,00 टोपी राख्ने योजना छ। (स्रोत)</li>
              <li>सबै क्रेडिट रिपोर्टहरूबाट मेडिकल ऋण हटाइनेछ। (स्रोत)</li>
            </ul>

            <h5 className="font-semibold mt-2 mb-1">ट्रम्प र भ्यान्सको नीति</h5>
            <p>ट्रम्प र भ्यान्सले सस्तो हेरचाह ऐन खारेज गर्न चाहन्छन्, र विगतका नीतिहरू पुनर्स्थापित गर्न चाहन्छन् जस्तै बीमा अस्वीकार गरिएको छ वा यसको लागि ठूलो लागत छ। पूर्व-अवस्थित अवस्थाहरू (सोच्नुहोस्: मधुमेह, उच्च रक्तचाप, दम) (स्रोत)</p>
          </div>
        </TabsContent>
        <TabsContent value="voting" className='flex flex-col gap-2 p-4'>
          <h2 className="text-xl font-bold mb-2">२०२४ अमेरिकी चुनावको लागि महत्त्वपूर्ण जानकारी</h2>
          <p className="mt-4">
            <a href="https://nepaltira.com" target="_blank" rel="noopener noreferrer" className="text-blue-600 hover:underline">
              थप मतदान जानकारीको लागि यहाँ क्लिक गर्नुहोस्
            </a>
          </p>
        </TabsContent>
      </Tabs>
    </>
  )
}

export default App
